[
    {
        "name": "Aluminum Foil",
        "score": "?",
        "price": "?",
        "notes": "An interesting solution",
        "description": [
            "A visitor sent in a tip to use aluminum foil, which may be a fun classroom project.  All you need is some sort of backing, aluminum foil, and some type of glue that adheres to aluminum foil.  If you want a really easy backing, you could use cardboard.  As for the glue, I would recommend spray adhesive since bonding with the foil may be a challenge and spray adhesive sticks to almost anything.",
            "I've used aluminum foil and sometimes it works but sometimes it just utterly fails.  I have not investigated this thoroughly and believe it might have something to do with the type of foil used."
        ]
    },
    {
        "name": "Appliances",
        "score": 4,
        "price": 1,
        "notes": "Works in a pinch",
        "description": [
            "You can use whiteboard markers on many appliances.  The factory's coating works pretty well, but marker can get stuck in the texture sometimes.  The major drawback is that it is hard to line your wall with washers, dryers, ovens, and refrigerators.",
            "Make sure to erase the whiteboard markers when done.  You don't want your refrigerator permanently discolored with some notes from work."
        ]
    },
    {
        "name": "Avery \"Write-On Cling Sheets\"",
        "score": "?",
        "price": "?",
        "notes": "Reported to work",
        "description": [
            "Reported to work very well.  It is just like a whiteboard that you can stick to the walls.  The 27\" x 32\" might be a bit small for your purposes, but it would work great for a small office whiteboard.  My only questions are about durability and long-term marker stains.  One visitor mentioned that their marker bled through the sheet and actually stained the wall.",
            "One good thing about these sheets is that they are portable and you can just throw them when they start to get worn."
        ]
    },
    {
        "name": "Carolina Pad \"Write On/Wipe Off Poster Board\"",
        "score": 5,
        "price": 5,
        "notes": "A rollable, portable whiteboard",
        "description": [
            "I was able to test one of these 22\" x 28\" pieces of plastic, and it really surprised me.  It was like having a small, rollable, handy whiteboard.  Markers erased completely and easily.  Also, the price is hard to beat; I found one retailer online that was selling this product for under $2.  The only bad thing is that it is not large enough for my table or wall, but it is great for individual work areas."
        ]
    },
    {
        "name": "Cellophane / Plastic Wrap",
        "score": 1,
        "price": 5,
        "notes": "Good for emergencies, bad durability",
        "description": [
            "The plastic with which you wrap food usually works.  This also includes most heat-shrink window insulation.  As always, test first.  This type of material works well initially, but usually stains with long-term marks."
        ]
    },
    {
        "name": "Ceramic Material",
        "score": 5,
        "price": 1,
        "notes": "Used in high-end whiteboards",
        "description": [
            "This is probably outside the price range of most visitors, but really high-end whiteboards use metal and a ceramic material to make an extremely nice surface with a really high durability and lifetime when not dropped and broken.  Ceramic dishes could also work, depending on the amount of scratches on the surface.",
            "I rated this poorly on price because most people who are visiting this website do not usually require such an expensive solution."
        ]
    },
    {
        "name": "Contact Paper",
        "score": 3,
        "price": 5,
        "notes": "Usually works well",
        "description": [
            "Just head to your local retailer and pick up a roll for a couple dollars.  Quick and easy.  Test it out before buying to make sure that your type of contact paper will erase cleanly because some textures and materials do not work with dry erase markers.  Typically, the cheaper contact paper works better.  You want ones that are extremely smooth and glossy.",
            "This could also take the form of book cover plastic.  One reader suggested using transparent adhesive book wrap plastic, which is used to protect book covers.",
            "The steps for making a whiteboard are pretty basic but there's a trick you should know to avoid bubbles under the contact paper.  First, cut the contact paper to fit and then peel back a corner.  Apply the corner to the surface, making sure it still lines up properly.  Slowly peel away more and use a flat edge, such as a credit card, to push the contact paper onto the surface.  Make sure to go slow and get rid of any air bubbles right away, since you will not be able to remove them later."
        ]
    },
    {
        "name": "Evergreen Dry Erase Film",
        "score": "?",
        "price": "?",
        "notes": "Suggestion from a visitor",
        "description": [
            "A reader suggested that people investigate this product.  It comes in large rolls, though information online is sketchy or not really available."
        ]
    },
    {
        "name": "Glass",
        "score": 5,
        "price": 2,
        "notes": "Works great",
        "description": [
            "Test first!  I have had a report that some windows do not erase well, which might indicate the window is not actual glass.",
            "I write all over windows, glass mirrors, and glass table tops.  It would be difficult and maybe dangerous to coat a wall with glass, but at least it is a convenient surface.  Sometimes markers can be a little stubborn to erase, but numerous cleaners can get them off with almost no work.",
            "It's extremely difficult to stain glass with markers, so this might be an option if you need to keep notes around for a while."
        ]
    },
    {
        "name": "Laminated Sheets",
        "score": 3,
        "price": 4,
        "notes": "Fairly good and inexpensive",
        "description": [
            "If you can get a good, smooth laminated piece of tag board or similar material, this will work for individual or small whiteboards.  Dry erase markers eventually do stain them if the marker is left on for long periods of time.  It may be difficult to erase the marker, depending on the laminate used.",
            "If you are a teacher, this would make great individual dry erase board for your class, especially if you have access to a laminating machine at school.  Laminating tag board can give you a plain board.  You can also print out a grid, template, number line, math problems and much more.  Teachers can use these as easy, reusable worksheets for kids.  I've use this to keep track of turns and hit points during D&D battles.",
            "The method here is simple:  Just find some tagboard and laminate it.  You may need to find a local copy shop or a school to get it laminated with one of those nice industrial-strength laminating machine.  I have heard of bad results if you try to use some types of clear contact paper or a similar sticky plastic as a laminate.  You want to find the type that is fused together by heated rollers."
        ]
    },
    {
        "name": "Latex Paint (High Gloss)",
        "score": 1,
        "price": 1,
        "notes": "Complete failure",
        "description": [
            "A suggestion from a paint guy at the local hardware store was to use Behr High-Gloss, 100% Acrylic Latex, Ultra Pure White paint.  That didn't work at all.  The $12 quart of paint thickly coated my 4' x 8' gaming table.  However, nothing was erasable; it worked as well as paper."
        ]
    },
    {
        "name": "MB-3000 Whiteboard Coating",
        "score": 4,
        "price": 5,
        "notes": "Turns a surface into a whiteboard",
        "description": [
            "<div class=\"Fl(end)\"><a href=\"mb3000.jpg\"><img src=\"mb3000-small.jpg\"/></a></div>",
            "I was contacted by [Solutions MB](http://www.solutionsmb.com/) regarding their whiteboard repair kit.  It is a clear coating that you can apply to a surface that will turn it into a whiteboard.  I used the product to turn my ruined whiteboard into a new \"pinkboard\" (I painted it pink first then applied the coating for an extremely cool effect).  The surface wipes off markers well, but not quite as well as a whiteboard.  It was $40 for 8 oz, but you use only a thin coat to turn any painted surface into a whiteboard.",
            "The downside is that when you apply it with a foam brush, it may cause some minor streaks and really tiny bubbles to show up on the surface of the coating.  The problem I had may have been made worse because I didn't wait for the paint underneath to finish curing.  Make sure to wait a couple weeks after painting your whiteboard before applying this wonderful coating."
        ]
    },
    {
        "name": "MB4000W Whiteboard Coating",
        "score": 3,
        "price": 5,
        "notes": "Water-based coating to create a whiteboard",
        "description": [
            "[Solutions MB](http://www.solutionsmb.com/) came out with a newer version of their whiteboardcoating, MB3000.  It is water based and you don't need a well-ventilated room in order to apply it.  You need to carefully follow their instructions, but you are left with a very professional whiteboard coating on whatever surface you want.  It only takes a very thin layer of this stuff and you will be very happy with the results.  If you want to turn the walls of your house into whiteboard surfaces, this might be perfect.",
            "This coating makes a surface that is almost the same as some high-quality boards.  Nearly anything wipes right off.  Permanent marker and crayon take just a little rubbing and they come off too.",
            "First, you must prepare the surface.  It is best to work with the surface horizontally if possible.  They recommend you first coat your surface with a matte or eggshell, latex-based paint base.  You do not need to use white.  I used a rose colored pink.  It's possible to get the paint base before they add color to it so you can apply clear paint and preserve your original wall colors and decorations.",
            "Wait for the paint to cure, not merely dry.  This could take a week to be safe.",
            "Now you simply use a foam brush, roller, or other really smooth way to apply the MB4000W coating.  It doesn't take much.  You can even go over it again after an hour or two to generate a thicker coating.  Now you need to wait at least three days for the layer to cure, but then you are able to doodle on your wall, use whiteboard markers on the table, or be artistic wherever you applied the coating."
        ]
    },
    {
        "name": "Metal, Sheet",
        "score": "?",
        "price": "?",
        "notes": "Works for some metals",
        "description": [
            "I have heard that some metals will let you use a dry erase marker on them and it wipes off with ease.  Sometimes the metals are coated, other times they are not.  I need to delve into this area a bit more.",
            "Do be careful with pieces of metal.  Cutting them may produce extremely sharp edges and you really wouldn't want to cut yourself."
        ]
    },
    {
        "name": "Plastic, Page Protectors",
        "score": 2,
        "price": 5,
        "notes": "Good if you find the right one",
        "description": [
            "Slipping in a piece of cardboard or tag board to stiffen the plastic pocket will turn the plastic into a nice personal whiteboard.  Depending on the type of page protector, the dry erase marker may not wipe off or come off entirely.  For best results, get the really glossy and really cheap ones.  The textured ones have a harder time removing the marker.  While this isn't a good solution for my walls nor table, it may work well for you because you might already have all the necessary materials."
        ]
    },
    {
        "name": "Plastic, Sheet",
        "score": 4,
        "price": 5,
        "notes": "Very good and inexpensive",
        "description": [
            "<div class=\"Fl(end)\"><a href=\"hide.jpg\"><img src=\"tn-hide.jpg\"/></a> <a href=\"roll.jpg\"><img src=\"tn-roll.jpg\"></a></div>",
            "I purchased a roll of plastic from a local surplus store ([Ax-Man Surplus](http://ax-man.com/)) for $2.50.  It was labeled as a roll-up heat insulator, but it looks like a clear window shade.  The plastic is pretty durable and most markers will wipe off with no effort.  If left on, my troublesome red marker left a residue, but that was removable with a cleaner.  I mounted a roll under a window shade, then pulled up the window shade to show you how well it is hidden.  You can see this picture to the right.  Nobody suspects the sheet plastic is there, yet I have an instant writable surface when needed.",
            "I saw a page on the net that detailed making dry erase boards out of sheets of plastic that could be cut into the desired size, then they had supporting pieces of wood at the top and they would roll up with Velcro straps and be held as a roll until needed.  I can't find it now, but this clear shade is along the same lines as that page.  If you find that page, please let me know.",
            "It is easy to create a board from plastic sheets.  You can cut the plastic sheet to fit your surface, or mount it on the wall."
        ]
    },
    {
        "name": "Polycoated Cardboard",
        "score": 3,
        "price": 4,
        "notes": "Easy and effective",
        "description": [
            "The backs of political yard signs or scrap from screen printing jobs may be used as a whiteboard.  The marker may be difficult or impossible to remove if it stays too long on the cardboard.",
            "One visitor mentioned that this could be called \"Twin Wall Plastic Sheeting\".  It looks like corrugated cardboard that is made out of plastic instead of paper.",
            "If you intend to make a whiteboard out of this material, make sure to test first.  Some of these boards do not erase at all.  After that minor inconvenience, making a whiteboard is trivial.  Cut to size.  Done.  Super easy."
        ]
    },
    {
        "name": "Poly Sheets",
        "score": "?",
        "price": "?",
        "notes": "Looks great",
        "description": [
            "It looks like [these things](http://www.kk.org/cooltools/archives/000700.php) would do the trick nicely.  If you get creative and use duct tape, spray adhesive, or another method of attaching them to your wall, you could fill the area pretty fast."
        ]
    },
    {
        "name": "Polyurethane (Coating)",
        "score": 3,
        "price": 4,
        "notes": "Suggestion from visitors",
        "description": [
            "The Shower Board link (below) suggests that coating something like tile board with a wipe-on polyurethane may make the tile board more like a commercial whiteboard, but it also says that their tests failed when they used a polyurethane varnish.  They say that perhaps Minwax or Varathane Professional may work.",
            "I did try out an inconspicuous area on a Varathane coated floor.  The markers wiped right off, but I was not permitted to do an extended test."
        ]
    },
    {
        "name": "Rain-X / Hard Surface Protectant",
        "score": "?",
        "price": "?",
        "notes": "Suggestion from a visitor",
        "description": [
            "A reader had a whiteboard that no longer wiped away cleanly.  They tried Stanford Expo Whiteboard Cleaner but the board still seemed to cling to the marker.  They applied several layers of Hard Surface Protectant (claimed to be the same formula as Rain-X) to the clean board and waited a few hours.  After testing, they concluded that the board now works like it is new again."
        ]
    },
    {
        "name": "Tatco Whiteboard Sheets",
        "score": "?",
        "price": "?",
        "notes": "Suggestion from a visitor",
        "description": [
            "This is another product that I was told about but have not yet had the pleasure of testing.  They are described as portable plastic sheets that stick (static cling?) to surfaces.  It works with dry erase, wet erase, and permanent markers.  I wonder how well it stands up to use and permanent markers.  The product I see is $23 for twelve 37\" x 12\" sheets or $46 for twenty 37\" x 24\" sheets."
        ]
    },
    {
        "name": "Tileboard / Melamine / Shower board",
        "score": 2,
        "price": 5,
        "notes": "Large surface for cheap",
        "description": [
            "These are smooth, white, shower board sheets.  Usually they come in 4' x 8' panels.  Water just rolls off these things.  A single sheet coats my table nicely.  Take a marker with you and test the tile board in the store; some types of tileboard will work and others won't work at all.  I have found that the cheapest tile board works the best since it has no texture.  I have seen prices for $7 to $15 for various styles and colors.",
            "I invested $7 to get the cheap, glossy, white kind.  After testing, it seems to work tolerably well.  The markers don't quite wipe off cleanly, but it is an extremely cheap solution when compared to a commercial 4' x 8' whiteboard."
        ]
    },
    {
        "name": "Troy Dry Erase Sheets",
        "score": "?",
        "price": "?",
        "notes": "Self-stick poly sheets",
        "description": [
            "You can get a 48\" x 60\" roll of self-stick poly that works as a whiteboard.  Check out [Troy's website](http://www.troydryerase.com)."
        ]
    },
    {
        "name": "Vinyl Floor Tile",
        "score": "?",
        "price": "?",
        "notes": "Suggestion from a visitor",
        "description": [
            "This suggestion came from a frustrated visitor.  They understand that it is nearly impossible to get a perfectly smooth finish when applying a paint-on whiteboard coating, not to mention the other hassles.  You can get rolls of vinyl floor tile from hardware stores."
        ]
    },
    {
        "name": "WallTalkers",
        "score": "?",
        "price": "?",
        "notes": "Dry-erase wallpaper and contact paper",
        "description": [
            "A friend of mine mentioned he can get a type of wallpaper and a type of contact paper that would work.  It is designed as a dry erase whiteboard.  It probably would have worked wonderfully, but I don't have that kind of money available to coat the walls of my house.  Check out [WallTalkers](http://www.walltalkers.com/) and see what they have to offer."
        ]
    },
    {
        "name": "Whiteboard Paint",
        "score": "?",
        "price": "?",
        "notes": "White paint (not a coating)",
        "description": [
            "I read an article on the web saying that there is whiteboard paint.  It is similar to chalkboard paint, except it is white and very glossy.  It sounded ideal, but the paint is hard to find.  There is also magnetic paint that you can use as a base coat under the whiteboard paint to make a versatile whiteboard, which also is sometimes hard to find.",
            "I have wonderful visitors that have showed me different whiteboard paints.  One said for me to use [Markee™](http://dryerasemagic.com).  For $100 a gallon, you can turn any wall into a whiteboard.  Unfortunately, it also says the marker has to be erased within 24 hours, which is too restrictive for me.  Other visitors have steered me towards IdeaPaint, which is $3.75 a square foot (minimum 50 sq. ft. = $187.50).  Application is the same as the Solutions MB product; it is a single white-colored coating that can be painted on any smooth surface.  It does say to wipe clean after each use."
        ]
    }
]
